app/controllers/currencies_controller.rb

SELECT "currencies".* FROM "currencies" WHERE (LOWER(name) LIKE '%xcd%')
---
    def search
        @currencies = Currency.where('LOWER(name) LIKE ?', "%#{params[:search].downcase}%")